openfoam/day1/chamber-split-fine/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

// Educational split-inlet chamber, not an OIPT equipment design.
// Uniform 0.5 mm X/Y spacing; one cell through unchanged 1 mm depth.
// Two top slots: x=0.025..0.030 and x=0.070..0.075 m.
// Both slots share the inlet patch and the same downward speed.
// Total inlet width remains 0.010 m; total imposed flow is unchanged.
// Fourteen blocks connect internally without walls between them.
scale 1;
vertices
(
    (0 0 0) // vertex 0
    (0.02 0 0) // vertex 1
    (0.025 0 0) // vertex 2
    (0.03 0 0) // vertex 3
    (0.07 0 0) // vertex 4
    (0.075 0 0) // vertex 5
    (0.08 0 0) // vertex 6
    (0.1 0 0) // vertex 7
    (0 0.01 0) // vertex 8
    (0.02 0.01 0) // vertex 9
    (0.025 0.01 0) // vertex 10
    (0.03 0.01 0) // vertex 11
    (0.07 0.01 0) // vertex 12
    (0.075 0.01 0) // vertex 13
    (0.08 0.01 0) // vertex 14
    (0.1 0.01 0) // vertex 15
    (0 0.05 0) // vertex 16
    (0.02 0.05 0) // vertex 17
    (0.025 0.05 0) // vertex 18
    (0.03 0.05 0) // vertex 19
    (0.07 0.05 0) // vertex 20
    (0.075 0.05 0) // vertex 21
    (0.08 0.05 0) // vertex 22
    (0.1 0.05 0) // vertex 23
    (0 0 0.001) // vertex 24
    (0.02 0 0.001) // vertex 25
    (0.025 0 0.001) // vertex 26
    (0.03 0 0.001) // vertex 27
    (0.07 0 0.001) // vertex 28
    (0.075 0 0.001) // vertex 29
    (0.08 0 0.001) // vertex 30
    (0.1 0 0.001) // vertex 31
    (0 0.01 0.001) // vertex 32
    (0.02 0.01 0.001) // vertex 33
    (0.025 0.01 0.001) // vertex 34
    (0.03 0.01 0.001) // vertex 35
    (0.07 0.01 0.001) // vertex 36
    (0.075 0.01 0.001) // vertex 37
    (0.08 0.01 0.001) // vertex 38
    (0.1 0.01 0.001) // vertex 39
    (0 0.05 0.001) // vertex 40
    (0.02 0.05 0.001) // vertex 41
    (0.025 0.05 0.001) // vertex 42
    (0.03 0.05 0.001) // vertex 43
    (0.07 0.05 0.001) // vertex 44
    (0.075 0.05 0.001) // vertex 45
    (0.08 0.05 0.001) // vertex 46
    (0.1 0.05 0.001) // vertex 47
);

blocks
(
    hex (0 1 9 8 24 25 33 32) (40 20 1) simpleGrading (1 1 1)
    hex (1 2 10 9 25 26 34 33) (10 20 1) simpleGrading (1 1 1)
    hex (2 3 11 10 26 27 35 34) (10 20 1) simpleGrading (1 1 1)
    hex (3 4 12 11 27 28 36 35) (80 20 1) simpleGrading (1 1 1)
    hex (4 5 13 12 28 29 37 36) (10 20 1) simpleGrading (1 1 1)
    hex (5 6 14 13 29 30 38 37) (10 20 1) simpleGrading (1 1 1)
    hex (6 7 15 14 30 31 39 38) (40 20 1) simpleGrading (1 1 1)
    hex (8 9 17 16 32 33 41 40) (40 80 1) simpleGrading (1 1 1)
    hex (9 10 18 17 33 34 42 41) (10 80 1) simpleGrading (1 1 1)
    hex (10 11 19 18 34 35 43 42) (10 80 1) simpleGrading (1 1 1)
    hex (11 12 20 19 35 36 44 43) (80 80 1) simpleGrading (1 1 1)
    hex (12 13 21 20 36 37 45 44) (10 80 1) simpleGrading (1 1 1)
    hex (13 14 22 21 37 38 46 45) (10 80 1) simpleGrading (1 1 1)
    hex (14 15 23 22 38 39 47 46) (40 80 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (18 42 43 19)
            (20 44 45 21)
        );
    }
    outletLeft
    {
        type patch;
        faces
        (
            (0 24 32 8)
        );
    }
    outletRight
    {
        type patch;
        faces
        (
            (7 15 39 31)
        );
    }
    wafer
    {
        type wall;
        faces
        (
            (1 2 26 25)
            (2 3 27 26)
            (3 4 28 27)
            (4 5 29 28)
            (5 6 30 29)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 25 24)
            (6 7 31 30)
            (8 32 40 16)
            (16 40 41 17)
            (17 41 42 18)
            (19 43 44 20)
            (21 45 46 22)
            (15 23 47 39)
            (22 46 47 23)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 8 9 1)
            (24 25 33 32)
            (1 9 10 2)
            (25 26 34 33)
            (2 10 11 3)
            (26 27 35 34)
            (3 11 12 4)
            (27 28 36 35)
            (4 12 13 5)
            (28 29 37 36)
            (5 13 14 6)
            (29 30 38 37)
            (6 14 15 7)
            (30 31 39 38)
            (8 16 17 9)
            (32 33 41 40)
            (9 17 18 10)
            (33 34 42 41)
            (10 18 19 11)
            (34 35 43 42)
            (11 19 20 12)
            (35 36 44 43)
            (12 20 21 13)
            (36 37 45 44)
            (13 21 22 14)
            (37 38 46 45)
            (14 22 23 15)
            (38 39 47 46)
        );
    }
);

mergePatchPairs ();
