openfoam/day1/chamber-split-fine/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object transportProperties;
}

// Illustrative constant fluid property, not an OIPT process specification.
transportModel Newtonian;
// Kinematic viscosity in m^2/s.
nu [0 2 -1 0 0 0 0] 1.5e-5;
