openfoam/day1/chamber-split-fine/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers
{
    p
    {
        solver GAMG;
        smoother GaussSeidel;
        tolerance 1e-9;
        relTol 0;
    }
    U
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-9;
        relTol 0;
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent no;
    // No residualControl: finish the fixed iteration budget so that
    // saved late fields can be compared, independently of residuals.
}
// Damp changes between iterations to help the coupled solve settle.
relaxationFactors
{
    fields
    {
        p 0.3;
    }
    equations
    {
        U 0.7;
    }
}
